---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortWarn
source: html/afa1fb87-b33d-7d97-9a6c-27a3f5276c90.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.AdjustEdgeTooShortWarn Property

AdjustEdge is too short.

## Syntax (C#)
```csharp
public static FailureDefinitionId AdjustEdgeTooShortWarn { get; }
```